Revit 2027 API
RibbonButton.IsEnabledByContext Property
Indicates if this button can be executed. True if the pushbutton is permitted to be executed based on the current Revit context (active document, active view and active tool). False if the pushbutton is disabled because of the active context.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEnabledByContext { get; }
Public ReadOnly Property IsEnabledByContext As Boolean
	Get
public:
property bool IsEnabledByContext {
	bool get ();
}
member IsEnabledByContext : bool with get
Property Value
Boolean
Remarks
The button may be enabled for a given context but still disabled programmatically using the Enabled property for the button.
See Also
Reference
RibbonButton Class
Autodesk.Revit.UI Namespace